{
  "architectures": [
    "RobertaForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "sentimental",
    "1": "afraid",
    "2": "proud",
    "3": "faithful",
    "4": "terrified",
    "5": "joyful",
    "6": "angry",
    "7": "sad",
    "8": "jealous",
    "9": "grateful",
    "10": "prepared",
    "11": "embarrassed",
    "12": "excited",
    "13": "annoyed",
    "14": "lonely",
    "15": "ashamed",
    "16": "guilty",
    "17": "surprised",
    "18": "nostalgic",
    "19": "confident",
    "20": "furious",
    "21": "disappointed",
    "22": "caring",
    "23": "trusting",
    "24": "disgusted",
    "25": "anticipating",
    "26": "anxious",
    "27": "hopeful",
    "28": "content",
    "29": "impressed",
    "30": "apprehensive",
    "31": "devastated"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "afraid": 1,
    "angry": 6,
    "annoyed": 13,
    "anticipating": 25,
    "anxious": 26,
    "apprehensive": 30,
    "ashamed": 15,
    "caring": 22,
    "confident": 19,
    "content": 28,
    "devastated": 31,
    "disappointed": 21,
    "disgusted": 24,
    "embarrassed": 11,
    "excited": 12,
    "faithful": 3,
    "furious": 20,
    "grateful": 9,
    "guilty": 16,
    "hopeful": 27,
    "impressed": 29,
    "jealous": 8,
    "joyful": 5,
    "lonely": 14,
    "nostalgic": 18,
    "prepared": 10,
    "proud": 2,
    "sad": 7,
    "sentimental": 0,
    "surprised": 17,
    "terrified": 4,
    "trusting": 23
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.50.3",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
